TELEGRAM_BOT_TOKEN = '1347548081:AAGM95zgf5A4ZJqhed66OMHyxK91Tdch6Ec'

quiz = {"Q1" :{
     "question":"Ви плануєте організувати публічний кінопоказ не дуже відомого, але важливого, на вашу думку, фільму. Однак постає питання авторських прав. Ви сумніваєтеся як краще вчинити",
     
     "a1":"Зв’яжуся з дистриб’юторами фільму з бажанням провести показ кіностічки. Поясню, що кінопоказ буде безкоштовним і домовлятимуся про вигідні умови показу фільму з правовласником. Усе ж заради мистецтва!",
     "a2": "Просто покажу фільм, не турбуючись про ліцензію. Що зі мною може зробити правовласник за невеликий кінопоказ для кількох десятків людей. Мене ж за показ фільму в тюрьму не посадять.",
     "a3": "Відмовлюся від ідеї показувати фільм, ця вся морока  з ліцензіями, правовласниками і прокатом того не варта.", 
     "exp1": "Кінопоказ проходить успішно, після перегляду вдалося активно обговорити фільм з глядачами, а що вас найбільше потішило - це ваша доброчесність і відсутність докорів совісті.",
     "exp1-impact-points": 1,
     "exp1-pleasure-points" : 2, 
     "exp1-reputation-points" : 1, 

     "exp2": "Кінопоказ проходить успішно, однак вас це не тішить, адже через деякий час легальні дистриб’ютори фільму зв’язуються з вами. Може ви не знали, але просто показавши фільм, ви порушили майнові авторські права на публічний показ. Тому легальний прокатник тепер вимагає від вас штраф у вигляді 3 розмірів від ціни ліцензії прокату. І це вам ще дуже пощастило, могло ж бути і гірше.",    
     "exp2-impact-points": 1,
     "exp2-pleasure-points" : -2, 
     "exp2-reputation-points" : 1, 
     
    "exp3":"Найкраще просто посидіти вдома і не морочити собі голови, правда ж? Але який тоді з вас активіст і культурний менеджер?",
    "exp3-impact-points": 0,
    "exp3-pleasure-points" : 0, 
    "exp3-reputation-points" : 0},
    

"Q2" :{
     "question":"Ви дізналися, що закордонна музична група, яка вам дуже подобається, робить невеликий тур по Україні. Вам якось вдалося домовитися про концерт у вашому місті. Які ваші наступні дії?",
     
     "a1":"Зроблю закритий івент, щоб підкреслити елітарність майбутнього концерту",
     "a2": "Зроблю інформаційну кампанію в інтернеті, вкладуся в таргетовану рекламу",
     "a3": "Підготую афіші та розвішу їх по місту, аби привернути увагу громади ", 
     "exp1": "На жаль, про концерт майже ніхто не дізнався, прийшли лише ваші друзі. Подія не вдалась, ви втратили гроші, які вклали у оренду залу, а також жоден артист не бажає більше мати з вами справи.",
     "exp1-impact-points": 1,
     "exp1-pleasure-points" : 0, 
     "exp1-reputation-points" : -1, 

     "exp2": "Схоже, що ваші смаки в музиці занадто вишукані, адже група та напрям музики важко сприймається громадою вашого міста.Тому на концерт прийшло не так вже й багато людей. Однак подія вийшла камерною та атмосферною, хоча квитки і не окупили гонорар артистів та оренду залу.",    
     "exp2-impact-points": 1,
     "exp2-pleasure-points" : 1, 
     "exp2-reputation-points" : 1, 
     
    "exp3":"Схоже, що ви обрали не той метод комунікації або ж просто цей метод не подіяв на вашу цільову аудиторію, тож концерт був малолюдним. Квитки не окупили гонорар артистів та оренду залу",
    "exp3-impact-points": 1,
    "exp3-pleasure-points" : -1, 
    "exp3-reputation-points" : -1},
     

     "Q3" :{
     "question":"Ви організовуєте виставку картин відомого сучасного художника. Однак якось так вийшло, що одну з картин вкрали. Що робитимете?",
     
     "a1":"Викличу поліцію та юристів, нехай розбираються.",
     "a2": "Спробую власноруч все з'ясувати, не привертаючи багато уваги.",
     "a3": "Ви заявляєте, що умиваєте руки. Все ж картина - це власність художника, а не ваша, нехай він і бідкається.", 
     "exp1": "Ви витратили купу свого часу на тяганину зі слідством, однак це не дало ніякого результату. Але ви хоча б старалися, та сприяли слідству, до вас питань немає.",
     "exp1-impact-points": 0,
     "exp1-pleasure-points" : -1, 
     "exp1-reputation-points" :1, 

     "exp2": "Вам нічого не вдається, художник розлючений, а креативна спільнота ображена вашим безвідповідальним ставленням до мистецтва.",    
     "exp2-impact-points": -1,
     "exp2-pleasure-points" : -5, 
     "exp2-reputation-points" : -1, 
     
    "exp3":"Митець обурений вашою цинічністю та безвідповідальністю. На вас ображена вся мистецька спільнота, а ваш провал згадуватимуть ще дуже довго",
    "exp3-impact-points": -1,
    "exp3-pleasure-points" : -1, 
    "exp3-reputation-points" : -4},


     "Q4" :{
     "question":"Ви виграли грант для проведення конференції. Грантодавець оплатив блокнотики/ручки, кава-брейк та харчування для учасників. Все йшло прекрасно, однак, коли було вже пізно, ви розумієте, що переплутали одну деталь - харчування забезпечувалося лише учасникам з инших міст. Що робитимете?",
     
     "a1":"Вкладу у це свої кошти, а потім попрошу донора повернути їх.",
     "a2": "Запропоную учасникам оплатити свої обіди самостійно.",
     "a3": "Запропонувати учасникам поділитися оплаченими обідами з иншими учасниками.", 
     "exp1": "Всі учасники залишилися задоволені, але донор гроші не повернув, адже ви підписували контракт (треба було уважніше читати!). Тому ваш активізм влетів вам в копійочку",
     "exp1-impact-points": 4,
     "exp1-pleasure-points" : -4, 
     "exp1-reputation-points" : 3, 

     "exp2": "Учасники обурені, не розуміють чому для одних харчування безкоштовне, а для инших — платне. Більшість учасників конференції не хоче більше мати ніяких справ ні з вами, ні з вашою організацією, а деякі навіть написали гнівні пости у фейсбуці, де присоромили ваші менеджерські якості. Тож тепер про ваш провал знає більшість знайомих.",    
     "exp2-impact-points": -1,
     "exp2-pleasure-points" : -7, 
     "exp2-reputation-points" : -3, 
     
    "exp3":"Така ваша спонтанна ідея спочатку викликала нерозуміння, але це, на диво, спрацювало навіть краще, ніж ви думали. Ви не лише нагодували усіх учасників, а ще й згуртували їх.",
    "exp3-impact-points": 4,
    "exp3-pleasure-points" : 4, 
    "exp3-reputation-points" : 1},

          "Q5" :{
     "question":"Ви організовуєте тематичний захід-вечірку, де продаєте трохи алкоголю для настрою Все класно, коктейлі від вашого друга-бармена всім заходять, вечірка в самому розпалі. Але через шум до вас завітала поліція та зафіксувала акт продажу алкоголю без ліцензії. Що робити?",
     
     "a1":"Ви намагаєтесь вирішити все спокійно, вмовити поліцейських не застосовувати ніяких дій. Вони хіба не люди?",
     "a2": "Ви запевняєте копів, що алкоголю не так уже й багато, і у вас тут звичайна дружня вечірка.",
     "a3": "Ви хочете все тихенько зам’яти і продовжити веселитися, тому пропонуєте копам хабар.", 
     "exp1": "Вам пощастило, що вас спіймали вперше, поліціянти зжалились над вами і ви обійшлися попередженням без створення протоколу правопорушення. Ваше щастя, адже, якби не доброта полісменів, ви мусили б сплатити штраф у розмірі 40% вартості алкоголю, який ви продавали. Але цього разу пронесло.",
     "exp1-impact-points":1,
     "exp1-pleasure-points" :1, 
     "exp1-reputation-points" :1, 

     "exp2": "Ви самі у всьому зізналися, тому поліцейські все ж складають акт про порушення. На вас чекає штраф у розмірі 40% вартості алкоголю, який ви продавали. А якщо не захочете сплачувати штраф, то цю суму все одно стягнуть з вас, але вже за рішенням суду. От і організовуй після цього вечірки!",    
     "exp2-impact-points":1,
     "exp2-pleasure-points" : -1, 
     "exp2-reputation-points" : -5, 
     
    "exp3":"Поліцейські обурені тим, як ви нахабно ставитеся до їхньої професії та дозволили собі подумати, що людей у формі можна купити. Тому вони вирішили покарати вас за всією суворістю закону. І замість того, щоб накласти на вас 1 штраф за розповсюдження алкоголю без ліцензії, ви ще й отримуєте адміністративну відповідальність як посадова особа. Весь алкоголь та виручку з бару конфісковують, а ваша вечірка перетворюється у перформанс з поліцейськими, адже довелося ще довго провозитися з їхніми паперами. І це не кажучи вже про те, що вам світить за пропонування хабара. Ви серйозно влипли. Але dura lex, sed lex.",
    "exp3-impact-points": -1,
    "exp3-pleasure-points" : -4, 
    "exp3-reputation-points" : -1},

               "Q6" :{
     "question":"Ви організовуєте великий фестиваль, однак вам потрібно отримати дозвіл від місцевої влади для оренди багатьох приміщень. Ви пишете звернення, однак вам довго не відповідають, а рекламна кампанія вже запущена і дати піджимають. Ви йдете до відповідного департаменту, аби дізнатися в чому затримка. Чиновник доброзичливо говорить з вами, а потім запевняє, що дасть вам всі необхідні приміщення в оренду, натякаючи на хабар. Ваші дії?",
     
     "a1":"Гнівно відмовляєтесь від хабара і обіцяєте звернутися в поліцію.",
     "a2": "Ви погоджуєтесь дати хабар і отримуєте бажані приміщення.",
     "a3": "Ви виносите проблему в публічний простір, написавши пост у соцмережі, де затегали міського голову, ЗМІ та всіх, хто може якось повпливати на ситуацію. ", 
     "exp1": "В поліції без доказів вам ніхто не повірив. Чиновник на вас розлючений і більше ніколи не стане з вами працювати, цього разу приміщення ви також не отримали. Багато подій фестивалю довелося відмінити через відсутність місць для їхнього проведення.",
     "exp1-impact-points": 0,
     "exp1-pleasure-points" : -4, 
     "exp1-reputation-points" : -1, 

     "exp2": "Фестиваль проходить прекрасно, ви отримуєте купу подяк та схвальних відгуків. Однак тепер багато хто знає, що ви готові дати хабар, якщо що. Тому тепер ваш культурний активізм полягає у тому, кому і скільки грошей заплатити, аби провести якусь культурну подію. Невдовзі майже всі ваші знайомі знають про ваші нестійкі принципи і  ви стаєте поганим прикладом на віки",    
     "exp2-impact-points": -4,
     "exp2-pleasure-points" : -4, 
     "exp2-reputation-points" : -4, 
     
    "exp3":"З вами зв’язався помічник мера і запевнив, що влада зацікавлена у співпраці з вами, тому чиновник-хабарник надасть вам всі необхідні приміщення для подій вашого фестивалю, якщо ви трохи пригальмуєте з поширенням інформації про корупцію у місцевій владі. Фестиваль пройшов без жодних проблем, але ви все ж зробили компроміс з власною совістю. Але що не зробиш заради мистецтва, правда ж?",
    "exp3-impact-points": 3,
    "exp3-pleasure-points" : -5, 
    "exp3-reputation-points" : 1},
               "Q7" :{
     "question":"Ви запланували захід - почали піар- та медіа-кампанію, половину квитків розкупили. Але раптом в країні починається карантин і всі публічні заходи, де присутні понад 40 осіб відміняють. Захід на носі, як ви вчините?",
     
     "a1":"Нічого відміняти не буду, хворих у місті ще немає, нічого не станеться.",
     "a2": "Захід відміню, гроші за квитки повертати не буду. Все ж захід відбудеться, щоправда пізніше, коли карантин закінчиться.",
     "a3": "Захід відміню та поверну гроші за квитки, такого ж ніхто не міг передбачити.", 
     "exp1": "От халепа, квитки більше ніхто не купив, а у кого квитки вже були на руках вимагають повернути гроші. Захід провалився, адже участь взяли дуже мало осіб. А вас ще й всюди захейтили через халатність та безвідповідальність під час карантину.",
     "exp1-impact-points": -5,
     "exp1-pleasure-points" : -4, 
     "exp1-reputation-points" : -4, 

     "exp2": "Завдяки вашому рішенню менше людей підхопило вірус. Усім, хто купив квитки, не сподобалось ваше рішення, адже тримати на руках квитки на захід, який відбудеться потім/не відбудеться взагалі - сумнівне капіталовкладення. Отаким безглуздим вчинком ви втратили частину своєї цільової аудиторії",    
     "exp2-impact-points": -1,
     "exp2-pleasure-points" : -1, 
     "exp2-reputation-points" : -4, 
     
    "exp3":"Завдяки вашому рішенню менше людей підхопило вірус. Весь процес повертання коштів за квитки створив вам трохи клопоту, однак ви більше нікому нічого не винні, і це прекрасно!",
    "exp3-impact-points": 1,
    "exp3-pleasure-points" : -5, 
    "exp3-reputation-points" : 1},

                    "Q8" :{
     "question":"Ви плануєте організовувати культурний захід з дуже обмеженим (як завжди) бюджетом. Дуже вдало з вами зв’язується кандидат у депутати з бажанням виступити на заході та частково профінансувати витрати, адже скоро вибори. Ваші дії?",
     
     "a1":"Не відмовлю кандидату в депутати, адже він профінансує захід просто сказавши пару слів перед аудиторією. Думаю, що це того варте, чому відмовлятися?.",
     "a2": "Ви чемно відмовляєте кандидату в депутати, адже не хочете аби вас асоціювали з якоюсь політичною силою, та пояснюєте, що культура не пов’язана з політикою.",
     "a3": "Ви вигадуєте як провести захід так, аби отримати кошти від депутата і одночасно приховати будь-який зв’язок з політикою. ", 
     "exp1": "Захід відбувся з усіма плюшками за додатковий бюджет від депутата, однак учасників заходу обурила промова майбутнього народного обранця на культурному заході, тому ви потерпаєте від репутаційних втрат.",
     "exp1-impact-points": -5,
     "exp1-pleasure-points" : -5, 
     "exp1-reputation-points" : -1, 

     "exp2": "Депутат вас зрозумів і виступив на иншому заході (на щастя не вашому). Ви провели успішний захід і не переймаєтеся політичними проблемами.",    
     "exp2-impact-points": 1,
     "exp2-pleasure-points" :1, 
     "exp2-reputation-points" :1, 
     
    "exp3":"Передбачувано, але ви не змогли всидіти на двох стільцях. Тому захід провалився, ваша аудиторія подивована всім дійством, а депутат вимагає повернути гроші.",
    "exp3-impact-points": -1,
    "exp3-pleasure-points" : -3, 
    "exp3-reputation-points" : -4},


     "Q9" :{
     "question":"Ви працюєте на основній роботі по 8 годин, але натрапляєте на цікаву заявку. Вона величезна і дуже складна. Але ж у вас є ідея і можливість її реалізувати. Однак ви розумієте, щоб написати якісну заявку ви мусите взяти вихідні за свій рахунок, хоча останнім часом з грошима у вас все складно. Як ви вчините?",
     
     "a1":"Так і бути, візьму вихідні. Головне ж ідея. І реалізація принесе велику користь громаді, та й мені передбачена зарплата як менеджеру.",
     "a2": "Ви лишаєте ідею займатися цією заявкою і стабільно заробляєте на життя на своїй постійній роботі.",
     "a3": "Спробую всидіти на двох стільцях - писатиму заявку, але вихідні не братиму. Все ж активізм не повинен заважати основній діяльності. Головне прикласти достатньо зусиль!", 
     "exp1": "Як би ви не старалися написати якісну заявку, все одно серед заявників були кращі проєкти, тому все даремно. Ви ледве зводите кінці з кінцями і впадаєте в депресію через марно витрачений час.",
     "exp1-impact-points": 0,
     "exp1-pleasure-points" : -4, 
     "exp1-reputation-points" : 0, 

     "exp2": "Вас гризуть сумніви, ви весь час ставите собі запитання “А може...?”. Все ж пізніше дізнаєтеся, що фінансування отримали проєкти менш цікаві за ваш, ви впадаєте в депресію через втрачену можливість.",
     "exp2-impact-points": 0,
     "exp2-pleasure-points" : -4, 
     "exp2-reputation-points" : 0, 
     
    "exp3":"Ви недосипаєте, весь вільний час приділяєте написанню заявки, де викладаєте все коротко і влучно. І ваші зусилля винагороджує грантодавець, давши вашому проєкту фінансування. Хто ж знав?",
    "exp3-impact-points": 1,
    "exp3-pleasure-points" :1, 
    "exp3-reputation-points" : 1},

     "Q10" :{
     "question":"Ви знову беретеся за написання складної заявки. З творчою частиною ви впорались, а от із бюджетом біда. Треба щось із цим робити!",
     
     "a1":"Для креативного класу. Кому буде цікавіше дізнаватися про мистецтво, аніж їм? ",
     "a2": "Для пенсіонерів",
     "a3": "Для молоді, це наше майбутнє, треба вкладати у їхній розвиток!", 
     "exp1": "Грантодавець не профінансував ваш проєкт, адже він вважає, що креативному класу не потрібне ніяке навчання з мистецтва, вони і так усе знають і самі зможуть навчитися при потребі.",
     "exp1-impact-points": 0,
     "exp1-pleasure-points" : -1, 
     "exp1-reputation-points" : 0, 

     "exp2": "Грантодавець зацікавився вашою цікавістю до культурної просвіти людей поважного віку та профінансував проєкт.",
     "exp2-impact-points": 0,
     "exp2-pleasure-points" : -1, 
     "exp2-reputation-points" : 0, 
     
     "exp3": "молодь — це дуже широке поняття — повважав грантодавець і не виділив кошти.",
    "exp3-impact-points": 0,
    "exp3-pleasure-points" : -1, 
    "exp3-reputation-points" : 0},

      "Q11" :{
     "question":"Ви пишете грантову заявку на проведення навчання про мистецтво для однієї з груп вашої громади. Для кого будете організовувати навчання?",
     
     "a1":"вернуся до бухгалтера для написання бюджету. Це дорого, але професійно. У вас є шанс виграти цей грант і це покриє всі витрати.",
     "a2": "Зекономлю на бухгалтері, але підсилю творчу частину з думкою: “Може грантодавець надихнеться і профінансує проєкт?”",
     "a3": "Спробую самостійно впоратися з бюджетом, хоча зовсім у цьому не розбираюся.", 
     "exp1": "Не все сталося, як гадалося. Грантодавець не профінансував ваш проєкт, ви лише даремно витратили гроші на бухгалтерські послуги.",
     "exp1-impact-points": 0,
     "exp1-pleasure-points" : -1, 
     "exp1-reputation-points" : 0, 

     "exp2": "Саме так і сталося, проєкт отримав фінансування, однак при реалізації виникли проблеми з недостатком коштів. Ви сяк-так завершили проєкт, так і не зрозумівши в чому справа. Для звітності ви все ж наймаєте бухгалтера, він-то вам і розповідає, що ви допустили неприпустимі помилки при складанні бюджету, тому вам доводиться закривати дірки в бюджеті своєю зарплатою з проєкту.",
     "exp2-impact-points": 4,
     "exp2-pleasure-points" : -4, 
     "exp2-reputation-points" : 1, 
     
     "exp3": "Якою б прекрасною не була ідея вашого проєкту, однак абсолютно неграмотно складений бюджет знизив ваші шанси отримати фінансування до нуля. Адже як можна довірити людині реалізовувати проєкт, якщо вона не вміє розпоряджатися грантовими коштами?",
    "exp3-impact-points": 0,
    "exp3-pleasure-points" : -1, 
    "exp3-reputation-points" : -5}
     
     
}


evaluation = {
     "bad":"<b>Ви персона для наслідування у культурному менеджменті.</b>\nВам, попри всю непередбачуваність роботи, вдалося не вигоріти, принести колосальну користь громаді та при цьому не впасти в бруд обличчям. Вас ставлять в приклад, беруть численні інтерв’ю та запрошують на конференції ділитися досвідом. Оце ви красава, поважаємо!",
     "middle":"<b>Ви початківець у культурному менеджменті.</b>\nПомітно, що ви знаєте як просувати культуру в маси, але все ж не маєте достатньо досвіду, аби це завжди виходило вдало. Пробуйте мислити нестандартно, втілюйте ідеї, випробовуйте різні методи, аналізуйте власні та чужі помилки і не переставайте вчитися - тоді усе вийде!",
     "good":"<b>Ви не культурний менеджер.</b>\nСхоже, що ви вирішили пройти цей тест заради цікавості, адже в культурному менеджменті ви майже не розбираєтесь. Але не впадайте у відчай, адже робота культурного менеджера - це все ж таки робота, тому не переставайте працювати. Адже культурними менеджерами не народжуються, культурними менеджерами стають!"
}





